# NonUniquePropertySetName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PropertySetElementFailures..::..NonUniquePropertySetName Property
BuiltInFailures..::..PropertySetElementFailures Class See Also
---
The value of the given parameter is already in use as a property set name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NonUniquePropertySetName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NonUniquePropertySetName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NonUniquePropertySetName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PropertySetElementFailures Class
Autodesk.Revit.DB Namespace